Дошкольное_учреждение83/src/InformationRegisters/удуСоставСемьиРебенка/удуСоставСемьиРебенка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСоставСемьиРебенка</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СтепеньРодства</name>
    <type>
      <types>CatalogRef.удуСтепениРодства</types>
    </type>
  </resources>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЧленСемьи</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/CommonForms/удуФормаВыбораРодителя/Module.bsl
&НаСервере
Процедура СформироватьСписокРодителей()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуСоставСемьиРебенка.ЧленСемьи.Код КАК Код
	               |ИЗ
	               |	РегистрСведений.удуСоставСемьиРебенка КАК удуСоставСемьиРебенка
	               |ГДЕ
	               |	удуСоставСемьиРебенка.Ребенок = &Ребенок";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ребенок", ПараметрРебенок);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СписокКодовОтбора = Новый СписокЗначений;
	Для Каждого СтрокаРезультатаЗапроса Из РезультатЗапроса Цикл
		СписокКодовОтбора.Добавить(СтрокаРезультатаЗапроса.Код);
	КонецЦикла;
	
	ЭлементОтбораРодителя = РеквизитСписокРодителей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораРодителя.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбораРодителя.Использование = Истина;
	ЭлементОтбораРодителя.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Код");
	ЭлементОтбораРодителя.ПравоеЗначение = СписокКодовОтбора;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСписокРодителей();
КонецПроцедуры

&НаКлиенте
Процедура РеквизитСписокРодителейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(ВыбраннаяСтрока);
КонецПроцедуры
